### Terraform Plan Results 📋

**Environment:** Dev Account (975050047325)
**Workflow:** `Terraform - Dev Account`
**Run:** [#18](https://github.com/altanova-cloud/altanova-infrastructure/actions/runs/20463292616)

#### Terraform Plan Output

<details>
<summary>View Plan</summary>

```terraform
random_password.db_password: Refreshing state... [id=none]
module.vpc.data.aws_region.current[0]: Reading...
module.vpc.data.aws_caller_identity.current[0]: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.data.aws_partition.current[0]: Reading...
module.rds.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/altanova-dev-euw1-postgres/upgrade]
aws_secretsmanager_secret.db_password: Refreshing state... [id=arn:aws:secretsmanager:eu-west-1:975050047325:secret:altanova-dev-db-password-20251223142307668700000001-suYsv0]
module.rds.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=altanova-dev-euw1-postgres-20251223132130185300000001]
module.rds.module.db_instance.data.aws_partition.current: Reading...
module.rds.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/altanova-dev-euw1-postgres/postgresql]
module.deployment_role.aws_iam_role.deployment: Refreshing state... [id=DevDeployRole]
module.vpc.data.aws_region.current[0]: Read complete after 0s [id=eu-west-1]
module.rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-08dc7fcfa2ca5a79d]
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251223141935593500000004]
module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.rds.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=altanova-dev-rds-monitoring-role]
module.vpc.data.aws_caller_identity.current[0]: Read complete after 1s [id=975050047325]
module.rds.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=altanova-dev-rds-monitoring-role-20251223141936336400000007]
module.deployment_role.aws_iam_role_policy.deployment: Refreshing state... [id=DevDeployRole:DevDeploymentPolicy]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-04685f8c8a8c85579]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-053c932aac8628797]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-017cde5938b98c27d]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-08dc7fcfa2ca5a79d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0586c6004ca43016c]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-093edb48af362ec1d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-071428886ac0a5ad5]
aws_security_group.rds: Refreshing state... [id=sg-0abf5dbde4f2ebbca]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0809774d91d30428f]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00f062ca03bc2352e]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-031a6b2e8a82a443e]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-06a0d280cd160771d]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01c164989cbd49ba7]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-078c991b201e13790]
aws_vpc_security_group_ingress_rule.rds_from_vpc: Refreshing state... [id=sgr-0dcb334b5d400368d]
aws_vpc_security_group_egress_rule.rds_outbound: Refreshing state... [id=sgr-0a9580e3519231692]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=521888748]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-02cdcb209892fdfc9]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::975050047325:policy/vpc-flow-log-to-cloudwatch-20251223141935593100000003]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-03eefec34e5049ad4]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=altanova-dev-euw1-vpc]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0720a63f9af4d8521]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0008aedfead053ac5]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01c164989cbd49ba71080289494]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-074ff12926cd2b9b7]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0a43c370ebf0363ed]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c07ba216fced925f]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a8a146fc2e8c989c]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20251223141935593500000004-20251223141936268400000006]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-065459ecce5dc26ee]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-078c991b201e137901080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.db_password will be created
  + resource "aws_secretsmanager_secret_version" "db_password" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = "arn:aws:secretsmanager:eu-west-1:975050047325:secret:altanova-dev-db-password-20251223142307668700000001-suYsv0"
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "altanova"
      + db_subnet_group_name                  = "altanova-dev-euw1-vpc"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16.4"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "altanova-dev-euw1-postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::975050047325:role/altanova-dev-rds-monitoring-role"
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "altanova-dev-euw1-postgres-20251223132130185300000001"
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 7
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-euw1-postgres"
          + "Project"     = "AltaNova"
        }
      + tags_all                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "altanova-dev-euw1-postgres"
          + "Project"     = "AltaNova"
        }
      + timezone                              = (known after apply)
      + username                              = "dbadmin"
      + vpc_security_group_ids                = [
          + "sg-0abf5dbde4f2ebbca",
        ]

      + timeouts {}
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds_address                = (known after apply)
  + rds_endpoint               = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Next Steps:**
- Review the plan carefully
- If approved, merge this PR to trigger apply
- Dev environment will auto-apply after merge (no manual approval)
